tap "clojure-lsp/brew"
tap "clojure/tools"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sptim/formulae"
brew "antibody"
brew "libpng"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "atuin"
brew "automake"
brew "gettext"
brew "avrdude"
brew "readline"
brew "sqlite", link: true
brew "awscli"
brew "libssh2"
brew "bat"
brew "bison"
brew "gdbm"
brew "glib"
brew "libffi"
brew "libx11"
brew "python@3.9"
brew "clang-format"
brew "cmake"
brew "libnghttp2"
brew "libssh"
brew "qemu"
brew "lima"
brew "colima"
brew "coreutils"
brew "exiftool"
brew "flyctl"
brew "fzf"
brew "gd"
brew "gdk-pixbuf"
brew "git-lfs"
brew "libksba"
brew "pinentry"
brew "gnupg"
brew "gopls"
brew "gpgme"
brew "netpbm"
brew "gts"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "hadolint"
brew "hledger"
brew "htmlq"
brew "htop"
brew "jaq"
brew "krb5"
brew "ledger"
brew "openjdk"
brew "leiningen"
brew "libarchive"
brew "libgit2"
brew "libomp", link: true
brew "libyaml"
brew "luajit"
brew "mkcert"
brew "ncdu"
brew "neovim"
brew "node"
brew "node-build"
brew "node@18"
brew "nss"
brew "openjpeg"
brew "pgformatter"
brew "tcl-tk"
brew "pillow"
brew "pinentry-mac"
brew "python@3.10"
brew "ripgrep"
brew "rpm"
brew "rustfmt"
brew "shfmt"
brew "stylua"
brew "tokei"
brew "tree"
brew "wget"
brew "yarn"
brew "zlib"
brew "clojure/tools/clojure"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "qmk/qmk/qmk"
