tap "clojure/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "romkatv/gitstatus"
tap "sturdy-dev/tap"
tap "wpscanteam/tap"
brew "antibody"
brew "automake"
brew "gettext"
brew "glib"
brew "pkg-config"
brew "tcl-tk"
brew "cairo"
brew "openjdk@11", link: true
brew "clojure-lsp"
brew "cmake"
brew "ctags"
brew "diff-so-fancy"
brew "dive"
brew "doctl"
brew "fzf"
brew "gobject-introspection"
brew "pango"
brew "libtool"
brew "graphviz"
brew "htop"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "kepubify"
brew "leiningen"
brew "luajit", args: ["HEAD"]
brew "tree-sitter"
brew "neovim", args: ["HEAD"]
brew "ninja"
brew "node"
brew "ripgrep"
brew "ruby"
brew "sourcery"
brew "terraform"
brew "the_silver_searcher"
brew "clojure/tools/clojure"
brew "sturdy-dev/tap/sturdy"
cask "adoptopenjdk"
cask "raycast"
