tap "aws/tap"
tap "clojure-lsp/brew"
tap "clojure/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "jandedobbeleer/oh-my-posh"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sturdy-dev/tap"
brew "antibody"
brew "libpng"
brew "sqlite", link: true
brew "awscli"
brew "bat"
brew "glib"
brew "libx11"
brew "python@3.9"
brew "coreutils"
brew "exiftool"
brew "fzf"
brew "git-lfs"
brew "go", link: false
brew "gopls"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "hledger"
brew "htop"
brew "jq"
brew "krb5"
brew "libgit2"
brew "libnghttp2"
brew "libomp", link: true
brew "luajit"
brew "lynx"
brew "mkcert"
brew "ncdu"
brew "neovim"
brew "node"
brew "node-build"
brew "nss"
brew "perl"
brew "pgformatter"
brew "tcl-tk"
brew "pnpm"
brew "protobuf"
brew "python@3.10"
brew "ripgrep"
brew "rpm"
brew "shfmt"
brew "stylua"
brew "tree"
brew "websocat"
brew "wget"
brew "clojure/tools/clojure"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "qmk/qmk/qmk"
cask "cabal"
cask "lulu"
cask "session-manager-plugin"
