tap "cooklang/tap"
tap "homebrew/bundle"
tap "homebrew/services"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Isolated development environments using Docker
brew "docker-compose"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line tools for fly.io services
brew "flyctl"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Build and deploy Go applications on Kubernetes
brew "ko"
# Command-line, double-entry accounting tool
brew "ledger"
# Make/rake-like build tool using Go
brew "mage"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Tool for managing OCI containers and pods
brew "podman"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# CLI tool for CookLang Recipe Markup Language
brew "cooklang/tap/cook"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# E-books management software
cask "calibre"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Trains AIs to understand and translate texts
cask "deepl"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# VPN client
cask "mullvadvpn"
# Free and open-source RSS reader
cask "netnewswire"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# GUI client for PostgreSQL databases
cask "postico@1"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Messaging app with a focus on speed and security
cask "telegram"
# File transfer application
cask "transmit"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Baking Soda", id: 1601151613
mas "CrystalFetch", id: 6454431289
mas "NextDNS", id: 1464122853
mas "Strongbox", id: 897283731
mas "The Unarchiver", id: 425424353
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
