tap "acsandmann/tap"
tap "cooklang/tap"
tap "daveshanley/vacuum"
tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "speakeasy-api/tap"
tap "sst/tap"
tap "tattoy-org/tap"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Python code formatter
brew "black"
# Utility for connecting securely to your Cloud SQL instances
brew "cloud-sql-proxy"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Diff that understands syntax
brew "difftastic"
# Tool for exploring each layer in a docker image
brew "dive"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Language server for `golangci-lint`
brew "golangci-lint-langserver"
# Language server for the Go language
brew "gopls"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Post-modern modal text editor
brew "helix"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# CLI tool for searching and downloading app packages from the iOS App Store
brew "ipatool"
# Dex to Java decompiler
brew "jadx"
# Git-compatible distributed version control system
brew "jj"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Command-line, double-entry accounting tool
brew "ledger"
# Postgres C API library
brew "libpq", link: true
# Language Server for the Lua language
brew "lua-language-server"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# CLI tools for working with OpenAPI, Arazzo and Overlay specifications
brew "openapi"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Tool for managing OCI containers and pods
brew "podman"
# Python Language Server for the Language Server Protocol
brew "python-lsp-server"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Opinionated Lua code formatter
brew "stylua"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terraform Language Server
brew "terraform-ls"
# Linter for Terraform files
brew "tflint"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Tool for working with usage-spec CLIs
brew "usage"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# High-performance data structure server that primarily serves key/value workloads
brew "valkey"
# Command-line interface for Vercel
brew "vercel-cli"
# Command-line XML and HTML beautifier and content extractor
brew "xq"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Tiling window manager for macOS
brew "acsandmann/tap/rift"
# The worlds fastest and most scalable OpenAPI linter
brew "daveshanley/vacuum/vacuum"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# E-books management software
cask "calibre"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Universal database tool and SQL client
cask "dbeaver-community"
# AI-powered translator
cask "deepl"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Vector graphics editor
cask "inkscape"
# VPN client
cask "mullvad-vpn"
# Free and open-source RSS reader
cask "netnewswire"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# GUI client for PostgreSQL databases
cask "postico@1"
# Command-line shell and scripting language
cask "powershell"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Git client
cask "sublime-merge"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Messaging app with a focus on speed and security
cask "telegram"
# File transfer application
cask "transmit"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Emcee for Music", id: 408774844
mas "Kagi for Safari", id: 1622835804
mas "NextDNS", id: 1464122853
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Strongbox", id: 897283731
mas "Sweet Home 3D", id: 669289700
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
go "github.com/armsnyder/openapi-language-server"
go "github.com/cloudspannerecosystem/spanner-cli"
go "github.com/cloudspannerecosystem/wrench"
